{"Project":[{"title":"Serverless Framework with Amazon AWS","date":"2017-current","description":"Created microservices based on RESTful API using the serverless framework and taking advantage of Cloud Services of AWS such as Lambda, S3, DynamoDB, Cloudwatch, Gateway API.","imageSmall":"","imageHighResolution":"images/serverless-logo.png","altTextImage":"Serverless Framework Logo"},{"title":"Kiosk NLP","date":"2016-current","description":"The GSE IT team created a custom, touch enable Kiosk for use through the GSE.  As a side project to my other projects with NLP, I thought it would be fun to interface the Kiosks through spoken commands aka voice activated natural language.  For the speech to text conversion we used Google’s Speech APi, running a custom API on Heroku to the NLP engine on api.ai (formerly IBM Watson).  On the analytics side we have create a custom built Lambda function on AWS to store Kiosk data on DynamoDB, in hopes to create a self learning algorithm in the future.","imageSmall":"","imageHighResolution":"images/GSE-IT-Information-Kiosk-840x1024.png","altTextImage":"Picture of Kiosk in the CERAS building"},{"title":"SMILE","date":"2013-current","description":"Tasked with the challenge to re-engineer the SMILEPlug v1 handle additional studnets with lower power requirements aim developing world.  Created a proof of comcept on the raspberry pi.  Managed the team to transcode the current build process to run on a Raspberry Pi 3.  Programed the LED display in python with integration with the Linux start up process.","imageSmall":"","imageHighResolution":"images/SMILEPlug.jpg","altTextImage":"SMILEPlug v2"},{"title":"Veeam - Enterpise Infrastructure Backup ","date":"2010-current","description":"Our team’s SLA was 6 hours.  To meet this goal I designed a solution to leverage Veeam’s backup and replication, with VMware’s HA/vMotion, multiple Dell Server nodes and several SANs to create an geographical redundancy, fault tolerant infrastructure.","imageSmall":"","imageHighResolution":"images/veeam.png","altTextImage":"Crashplan Enterprise"},{"title":"Virtual Workspace","date":"2011-current","description":"Is a physical space required for real work to be accomplished?  Can a researcher or admin assistant be just as effective remotely as if they were in the office?  How about concerns on information security?  To address these issues I architected and implemented a virtual desktop architecture using VMware Horizon view leveraging our pre-existing virtual infrastructure by VMware.  Allowing GSE staff the option of using any endpoint to access securely a virtual desktop from any location.","imageSmall":"","imageHighResolution":"images/vmware-horizon-view.png","altTextImage":"VMware Horizon"},{"title":"VMware vSphere","date":"2010-current","description":"Converted and consolidated 100% of physical servers to an on-prem self hosted vSphere infrastructure.  Design a co-location DR solution to allow geophysical redundancy.   This includes network redundancy on the physical and transport layer.","imageSmall":"","imageHighResolution":"images/vmware_logo.png","altTextImage":"vmWare vSphere"},{"title":"Crashplan","date":"2010-2016","description":"As part of the business continuity/disaster recovery policy I was drafting, there were no campus provided backups solution for endpoints (desktops and laptops). As there was no cost effective method as a service I decided to go with Code42's CrashPlan ProE server running on our in-house VMware infrastructure.  At it’s peak in 2016, there were over 240 license users, 400+ devices, with around 10TB of data (hosted onsite on both disk/tape) with DR on AWS TL Gateway.","imageSmall":"","imageHighResolution":"images/CrashPlanPROe.png","altTextImage":"Crashplan Enterprise"},{"title":"Email for Stanford GSE","date":"2007-2013","description":"Managed the School's email system.  Exchange 2003, Exchange 2007 and Exchange 2010.  CAS NLB, Cluster Mailbox system","imageSmall":"","imageHighResolution":"images/exchange.png","altTextImage":"Microsoft Exchage"},{"title":"World of Warcraft: The Burning Crusade","date":"2007","description":"For the World of Warcraft: Burning Crusade project, I was promoted from Lead to Supervisor.  And was given the responsibility of starting a brand new team that was tasked to handle the entire weekly maintenance and patching of the worldwide World of Warcraft infrastructure which included over 17,000 servers, 15+ data centers in seven different countries.  Once again I was given the honor of launch World of Warcraft: BC worldwide.","imageSmall":"","imageHighResolution":"images/worldofwarcraftburningcrusade.jpg","altTextImage":"World of Warcraft Burning Crusade Logo"},{"title":"World of Warcraft","date":"2004","description":"During the years of 2003 till mid-2006, I quickly rose through the ranks of Technical Support Representative, to the very first System Administrator for World of Warcraft, to the Senior Blizzard Online Network Systems (BONS) Administrator.  I was the highest level of operational support to the World of Warcraft online platform.  From Alpha, Beta to Launch I was involved in all mid to major World of Warcraft incidents.  I was a major contributor to the creation of the Korean and European Network Operations teams.  I was a founding member of the BONS team and for one fun fact.  I push the button to launch World of Warcraft.","imageSmall":"","imageHighResolution":"images/worldofwarcraft.jpg","altTextImage":"World of Warcraft Logo"},{"title":"UCSC IT","date":"1998-2002","description":"As a student worker, I worked for University IT (aka CATS) as a \"Student Technical Support Specialist\" which was the highest position a student can obtain within IT.  In coordination with IT staff, I serviced and maintained all of the instructional computer labs on campus.  Which included writing specifications, repairing and troubleshooting hardware and software issues as well as training other technicians.  I was the only student worker given autonomy and worked with indirect supervision out in the field.","imageSmall":"","imageHighResolution":"images/ucsc.png","altTextImage":"UC Santa Cruz Logo"}]}